Revit 2026 API

# LinearArrayArrayElementsWithoutAssociation Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> ArrayElementsWithoutAssociation(
	Document aDoc,
	View dBView,
	ICollection<ElementId> ids,
	int count,
	XYZ translationToAnchorMember,
	ArrayAnchorMember anchorMember
)
```
```vb
Public Shared Function ArrayElementsWithoutAssociation (
	aDoc As Document,
	dBView As View,
	ids As ICollection(Of ElementId),
	count As Integer,
	translationToAnchorMember As XYZ,
	anchorMember As ArrayAnchorMember
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ ArrayElementsWithoutAssociation(
	Document^ aDoc,
	View^ dBView,
	ICollection<ElementId^>^ ids,
	int count,
	XYZ^ translationToAnchorMember,
	ArrayAnchorMember anchorMember
)
```
```fsharp
static member ArrayElementsWithoutAssociation :
        aDoc : Document *
        dBView : View *
        ids : ICollection<ElementId> *
        count : int *
        translationToAnchorMember : XYZ *
        anchorMember : ArrayAnchorMember -> ICollection<ElementId>
```

#### Parameters

aDoc Document

dBView View

ids ICollectionElementId

count Int32

translationToAnchorMember XYZ

anchorMember ArrayAnchorMember

#### Return Value

ICollectionElementId

#### Reference

LinearArray Class

Autodesk.Revit.DB Namespace